---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarTrimExtendData
source: html/14b1a941-3148-2bcc-f236-3557c9093f3f.htm
---
# RebarTrimExtendData Methods

Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully.